/*
*******************************************************************************
*                             硬件平台：32位变送器
*                            主芯片：STM32F103VE
*                        杭州泽大仪器有限责任公司
*
*                             作者：WenChaoZhu
*******************************************************************************
*文件名    ：        Log_WatchDog.c
*作用      ：
*原理      ：
*******************************************************************************
*版本             日期                    说明
*V0.1            2018/07/10             初始版本
*******************************************************************************
*/
#include "Log_WatchDog.h"
#include "stm32f10x.h"
//看门狗芯片MAX823 WDI 控制引脚
#define MAX823_WDI_PORT         GPIOE
#define MAX823_WDI_CLK          RCC_APB2Periph_GPIOE
#define MAX823_WDI_PIN          GPIO_Pin_2

#define MAX823_WDI_High         {GPIO_SetBits(MAX823_WDI_PORT,MAX823_WDI_PIN);}
#define MAX823_WDI_Low 		      {GPIO_ResetBits(MAX823_WDI_PORT,MAX823_WDI_PIN);}
/************************************************************************************************/
/* 函数名	：MAX823_WDI_Signal												 	 				*/
/* 输入		：无				 																	*/
/* 输出		: 无 																				*/
/* 作用		：输出看门狗信号								 									    */
/* 创建日期	：2018/07/30																		*/
/************************************************************************************************/
void MAX823_WDI_Signal(void)
{
	/* 喂狗:由于设置参数的时间太长，并且占用CPU，因此先喂狗，保证有1.5S的时间操作。 */
	if(GPIO_ReadOutputDataBit(MAX823_WDI_PORT,MAX823_WDI_PIN))
	{
		/* 喂狗 */
		MAX823_WDI_Low;
	}else
	{
		MAX823_WDI_High;
	}
}




/******************* (C) HZ Zeda Team *******************/

/*******************   (END OF FILE   *******************/

