/************************************************************************************************/
/** @file              : Mcu_Fram.c															*/
/** @author            : HZ Zeda Team															*/
/** @version           : V1.0.0.0																*/
/** @date              : 2016年11月07日															*/
/** @brief             : c file																	*/
/** @description       : 杭州泽大仪器--32位变送器--MCU内部Fram底层驱动文件						*/
/************************************************************************************************/
/** @attention		   :																		*/
/**																								*/
/** COPYRIGHT 2015 STMicroelectronics															*/
/**																								*/
/************************************************************************************************/
/**版本     作者            日期            说明													*/
/**V0.1    ZRDang      2016年11月07日     初始版本												*/
/************************************************************************************************/
/************************************************************************************************/
#include "Mcu_Fram.h"



/************************************************************************************************/
#if (1)//存储驱动函数
/************************************************************************************************/
/* 函数名	: McuFramInit																		*/
/* 输入  	: 无 																				*/
/* 输出		: 无 																				*/
/* 作用	 	: 配置外设铁电写保护引脚																*/
/* 创建日期 	: 2016/11/07																		*/
/************************************************************************************************/
void McuFramInit(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(FramWP_GPIO_CLK , ENABLE);
	
	/* WP写保护 GPIO */
	GPIO_InitStructure.GPIO_Pin = FramWP_GPIO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;     
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;	
	GPIO_Init(FramWP_GPIO_PORT, &GPIO_InitStructure);
	
	GPIO_SetBits(FramWP_GPIO_PORT, FramWP_GPIO_PIN );
}


#endif

/******************* (C) HZ Zeda Team *******************/

/*******************   (END OF FILE   *******************/
