/************************************************************************************************/
/** @file              : Mcu_RTC.h																*/
/** @author            : HZ Zeda Team															*/
/** @version           : V1.0.0.0																*/
/** @date              : 2016年11月07日															*/
/** @brief             : c file																	*/
/** @description       : 杭州泽大仪器--32位变送器--MCU外部RTC8025底层驱动文件						*/
/************************************************************************************************/
/** @attention		   :																		*/
/**																								*/
/** COPYRIGHT 2015 STMicroelectronics															*/
/**																								*/
/************************************************************************************************/
/**版本     作者            日期            说明													*/
/**V0.1    ZRDang      2016年11月07日     初始版本												*/
/************************************************************************************************/
/************************************************************************************************/
#ifndef __Mcu_RTC_H
#define __Mcu_RTC_H

#include "stm32f10x.h"


#define RTC_OE_PORT         (GPIOD)
#define RTC_OE_CLK          (RCC_APB2Periph_GPIOD)
#define RTC_OE_PIN          (GPIO_Pin_13)

/* 外部实时时钟RX8025  通信使能控制引脚OE */
#define RTC_OE_Enable()  	{GPIO_SetBits(RTC_OE_PORT,RTC_OE_PIN);}
#define RTC_OE_Disable() 	{GPIO_ResetBits(RTC_OE_PORT,RTC_OE_PIN);}

/* ***************************函数声明*************************** */
void McuRTCInit(void);


#endif


/******************* (C) HZ Zeda Team *******************/

/*******************   (END OF FILE   *******************/

