#ifndef __System_Config_h
#define	__System_Config_h

#include "stm32f10x.h"

/*============================ MACRO =========================================*/
//	<<< Use Configuration Wizard in Context Menu >>>
//===========================================================================
//
//  <e0> [ADC1]功能配置.
//  <i>  模拟信号采集(ADC1)配置相关的宏设置.
//	<h>  设置[ADC1]对应参数.
//	<o1.0..26>采集时间间隔设置		<1-3600:1><#*1000>
//	<i>配置模拟信号采集时间间隔.（设置时间范围在1秒--3600秒）
//  </h>
// 
//  </e>
#define ADC1_Function_Config_Enable				(0x01)
#define ADC1_Collect_Interval					(1000)


//===========================================================================
//
//  <e0> [数据记录]功能配置.
//  <i>  是否启动系统的数据记录功能.
//	<o1.0..1>  设置[数据记录] [启动\关闭] 菜单功能.
//  <0=> [关闭] 数据记录菜单功能.
//  <1=> [启动] 数据记录菜单功能.
// 
//  </e>
#define Save_Function_Config_Enable				(0x01)
#define Menu_Save_Data_Func						(0x01)


//===========================================================================
//
//  <e0> [传感器]功能配置.
//  <i>  配置每个通道的传感器功能类型(现在最多可以配置32个通道).
//	<h>  配置[传感器]功能类型.

//  <o1.0..6>配置传感器通道[1]功能类型..
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o2.0..6>配置传感器通道[2]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o3.0..6>配置传感器通道[3]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o4.0..6>配置传感器通道[4]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o5.0..6>配置传感器通道[5]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o6.0..6>配置传感器通道[6]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o7.0..6>配置传感器通道[7]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.
//	<15=> 配置传感器为 [门磁开关] 状态通道.

//  <o8.0..6>配置传感器通道[8]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o9.0..6>配置传感器通道[9]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o10.0..6>配置传感器通道[10]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o11.0..6>配置传感器通道[11]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 温度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o12.0..6>配置传感器通道[12]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o13.0..6>配置传感器通道[13]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 温度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o14.0..6>配置传感器通道[14]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 温度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o15.0..6>配置传感器通道[15]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o16.0..6>配置传感器通道[16]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o17.0..6>配置传感器通道[17]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o18.0..6>配置传感器通道[18]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o19.0..6>配置传感器通道[19]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o20.0..6>配置传感器通道[20]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o21.0..6>配置传感器通道[21]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o22.0..6>配置传感器通道[22]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o23.0..6>配置传感器通道[23]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o24.0..6>配置传感器通道[24]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o25.0..6>配置传感器通道[25]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o26.0..6>配置传感器通道[26]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o27.0..6>配置传感器通道[27]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o28.0..6>配置传感器通道[28]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o29.0..6>配置传感器通道[29]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o30.0..6>配置传感器通道[30]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o31.0..6>配置传感器通道[31]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  <o32.0..6>配置传感器通道[32]功能类型.
//  <0=> 不配置传感器类型功能.
//  <1=> 配置传感器为 [温度传感器] ℃.
//  <2=> 配置传感器为 [湿度传感器] %.
//  <3=> 配置传感器为 [单温卡片] ℃.
//  <4=> 配置传感器为 [温湿卡片] 的[温度]通道 ℃.
//  <5=> 配置传感器为 [温湿卡片] 的[湿度]通道 %.
//  <6=> 配置传感器为 [经度] 数据通道 °.
//  <7=> 配置传感器为 [纬度] 数据通道 °.
//  <8=> 配置传感器为 [速度] 数据通道 km/h.
//  <9=> 配置传感器为 [PT1000] ℃.
//  <10=> 配置传感器为 [盛亿网关] 温度通道℃.
//  <11=> 配置传感器为 [盛亿网关] 湿度通道%.
//  <12=> 配置传感器为 [创辉网关] 温度通道℃.
//  <13=> 配置传感器为 [创辉网关] 湿度通道%.
//  <14=> 配置传感器为 [二氧化碳] PPM值通道%.

//  </h>

//  <o33.0..1>无线RF卡片数据接收超时报警状态设置
//  <i>假如配置[报警],当卡片数据接收超时时，程序会设置对应通道的[报警状态].
//  <0=> [不报警]
//  <1=> [报警]


//  </e>
#define Sensor_Function_Config_Enable			(0x01)
#define Sensor_CH1_Config_Type					(0x01)
#define Sensor_CH2_Config_Type					(0x01)
#define Sensor_CH3_Config_Type					(0x00)
#define Sensor_CH4_Config_Type					(0x00)
#define Sensor_CH5_Config_Type					(0x00)
#define Sensor_CH6_Config_Type					(0x00)
#define Sensor_CH7_Config_Type					(0x00)
#define Sensor_CH8_Config_Type					(0x00)
#define Sensor_CH9_Config_Type					(0x00)
#define Sensor_CH10_Config_Type					(0x00)
#define Sensor_CH11_Config_Type					(0x00)
#define Sensor_CH12_Config_Type					(0x00)
#define Sensor_CH13_Config_Type					(0x00)
#define Sensor_CH14_Config_Type					(0x00)
#define Sensor_CH15_Config_Type					(0x00)
#define Sensor_CH16_Config_Type					(0x00)
#define Sensor_CH17_Config_Type					(0x00)
#define Sensor_CH18_Config_Type					(0x00)
#define Sensor_CH19_Config_Type					(0x00)
#define Sensor_CH20_Config_Type					(0x00)
#define Sensor_CH21_Config_Type					(0x00)
#define Sensor_CH22_Config_Type					(0x00)
#define Sensor_CH23_Config_Type					(0x00)
#define Sensor_CH24_Config_Type					(0x00)
#define Sensor_CH25_Config_Type					(0x00)
#define Sensor_CH26_Config_Type					(0x00)
#define Sensor_CH27_Config_Type					(0x00)
#define Sensor_CH28_Config_Type					(0x00)
#define Sensor_CH29_Config_Type					(0x00)
#define Sensor_CH30_Config_Type					(0x00)
#define Sensor_CH31_Config_Type					(0x00)
#define Sensor_CH32_Config_Type					(0x00)
#define Wireless_RF_Card_Data_Rece_Timeout_Alarm_Set	(0x00)




//===========================================================================
//
//  <e0> [湿度传感器]功能配置.
//  <i>  1、配置湿度传感器温度补偿功能.
//  <e1> [温度补偿]功能配置.
//	<h>  设置[温度补偿]的补偿数据提供传感器通道.
//  <o2.0..5>选择补偿通道
//  <0=> 不设置温度补偿功能.
//  <1=> 选择传感器通道1做为湿度传感器的温度补偿提供参数.
//  <2=> 选择传感器通道2做为湿度传感器的温度补偿提供参数.
//  <3=> 选择传感器通道3做为湿度传感器的温度补偿提供参数.
//  <4=> 选择传感器通道4做为湿度传感器的温度补偿提供参数.
//  <5=> 选择传感器通道5做为湿度传感器的温度补偿提供参数.
//  <6=> 选择传感器通道6做为湿度传感器的温度补偿提供参数.
//  <7=> 选择传感器通道7做为湿度传感器的温度补偿提供参数.
//  <8=> 选择传感器通道8做为湿度传感器的温度补偿提供参数.
//  <9=> 选择传感器通道9做为湿度传感器的温度补偿提供参数.
//  <10=> 选择传感器通道10做为湿度传感器的温度补偿提供参数.
//  <11=> 选择传感器通道11做为湿度传感器的温度补偿提供参数.
//  <12=> 选择传感器通道12做为湿度传感器的温度补偿提供参数.
//  <13=> 选择传感器通道13做为湿度传感器的温度补偿提供参数.
//  <14=> 选择传感器通道14做为湿度传感器的温度补偿提供参数.
//  <15=> 选择传感器通道15做为湿度传感器的温度补偿提供参数.
//  <16=> 选择传感器通道16做为湿度传感器的温度补偿提供参数.
//  <17=> 选择传感器通道17做为湿度传感器的温度补偿提供参数.
//  <18=> 选择传感器通道18做为湿度传感器的温度补偿提供参数.
//  <19=> 选择传感器通道19做为湿度传感器的温度补偿提供参数.
//  <20=> 选择传感器通道20做为湿度传感器的温度补偿提供参数.
//  <21=> 选择传感器通道21做为湿度传感器的温度补偿提供参数.
//  <22=> 选择传感器通道22做为湿度传感器的温度补偿提供参数.
//  <23=> 选择传感器通道23做为湿度传感器的温度补偿提供参数.
//  <24=> 选择传感器通道24做为湿度传感器的温度补偿提供参数.
//  <25=> 选择传感器通道25做为湿度传感器的温度补偿提供参数.
//  <26=> 选择传感器通道26做为湿度传感器的温度补偿提供参数.
//  <27=> 选择传感器通道27做为湿度传感器的温度补偿提供参数.
//  <28=> 选择传感器通道28做为湿度传感器的温度补偿提供参数.
//  <29=> 选择传感器通道29做为湿度传感器的温度补偿提供参数.
//  <30=> 选择传感器通道30做为湿度传感器的温度补偿提供参数.
//  <31=> 选择传感器通道31做为湿度传感器的温度补偿提供参数.
//  <32=> 选择传感器通道32做为湿度传感器的温度补偿提供参数.
//
//  </h>
// 
//  </e>
//  </e>
#define Hum_Sensor_Function_Config_Enable		(0x00)
#define Hum_Sensor_Tmp_Comp_Enable				(0x00)
#define Hum_Sensor_Tmp_Comp_CH					(0x01)


//===========================================================================
//
//  <e0> [Usart_2] 功能配置设定.
//	<i>现在有2个个能选择:0、无线卡片接收机;2、GPS定位设备;3、创辉无线网关;(现在3个功能不能同时使用,只能3个中选择一个.)
//  <e1> 配置 [Usart_2] 为 [无线卡片] 功能.
//	<i>  设置 无线卡片 功能相关参数.
//	<h>  无线卡片参数设置.
//  <o4.0..8>无线卡片接收数据超时时间.		<20-600:1>
//	<i>  卡片接收数据的超时时间一秒为单位,范围在20秒到10分钟之间(20--600秒).
//  </h>
//
//  </e>


//  <e2> 配置 <Usart_2> 为 <GPS定位> 功能.
//	<i>  设置 GPS定位设备 卡片相关参数.
//	<h>  GPS定位参数设置.
//  <o7.0..8>GPS定位数据接收超时时间.		<5-600:1>
//	<i>GPS定位接收数据的超时时间一秒为单位，范围在5秒到10分钟之间(5--600秒).
//  </h>
//
//  </e>

//  <e3> 配置 <Usart_2> 为 [创辉网关] 功能.
//	<i>  设置 创辉网关设备 相关参数.
//	<h>  创辉网关参数设置.
//  <o10.0..8>接收卡片数据超时时间.		<5-600:1>
//	<i>接收数据的超时时间一秒为单位，范围在5秒到10分钟之间(5--600秒)选择.
//  </h>
//
//  </e>


//  </e>
#define Usart_2_Function_Config_Enable				(0x00)
#define Wireless_RF_Card_Config_Enable				(0x00)
#define GPS_Config_Enable							(0x00)
#define Gateway_HZZH_Enable							(0x00)

#define Wireless_RF_Card_Data_Rece_Timeout_Time		(65)
/* 由于 Configuration Wizard 无法配置负数参数，因此只能将这两个参数固定，不能在设置向导中显示出来了。 */
#define Wireless_RF_Card_Data_Rece_Timeout_Para		(-500.0)
#define Wireless_RF_Card_Data_Rece_Timeout_Value	(-1000.0)

#define GPS_Data_Rece_Timeout						(65)
/* 由于 Configuration Wizard 无法配置负数参数，因此只能将这两个参数固定，不能在设置向导中显示出来了。 */
#define GPS_Data_Rece_Timeout_Para					(-500.0)
#define GPS_Data_Rece_Timeout_Value					(-1000.0)

#define Gateway_HZZH_ReceTimeout					(35)
/* 由于 Configuration Wizard 无法配置负数参数，因此只能将这两个参数固定，不能在设置向导中显示出来了。 */
#define Gateway_HZZH_TimeoutPara					(-500.0)
#define Gateway_HZZH_TimeoutValue					(-1000.0)


//===========================================================================
//
//  <e0> [Uart_4] 功能配置设定.
//	<i>现在有1个能选择:1、南京盛亿网关

//  <e1> 配置 [Uart_4] 为 [南京盛亿网关] 功能.
//	<i>  设置 南京盛亿网关 功能相关参数.
//	<h>  南京盛亿网关参数设置.
//  <o3.0..8>无线卡片接收数据超时时间.		<20-600:1>
//	<i>  探头接收数据的超时时间一秒为单位,范围在20秒到10分钟之间(20--600秒).
//  </h>
//
//  </e>

//  </e>
#define Usart4_App_Enable				(0x00)
#define Gateway_NJSY_Enable				(0x00)
#define Gateway_NJSY_ReceTimeout		(20u)
/* 由于 Configuration Wizard 无法配置负数参数，因此只能将这两个参数固定，不能在设置向导中显示出来了。 */
#define Gateway_NJSY_TimeoutPara		(-9990.0)
#define Gateway_NJSY_TimeoutValue		(-1000.0)

//===========================================================================
//
//  <e0> [短信]功能配置.
//  <i>  发送短信.
//  <o1.0..2>短信用户数量设置
//  <i>目前只允许最多3用户，最少可以设置1个用户。
//  <1=> 配置1个[用户]短信
//  <2=> 配置2个[用户]短信
//  <3=> 配置3个[用户]短信
// 
//  </e>
#define SMS_Function_Enable						(0x01)
#define SMS_User_Number							(0x03)


//===========================================================================
// 
//  <e0> [打印]功能配置. 
//  <i>  系统数据[打印].
//
//  <o1.0..2>打印传感器通道数量设置
//  <1=> 配置1个传感器通道
//  <2=> 配置2个传感器通道
//  <3=> 配置3个传感器通道
//  <4=> 配置4个传感器通道
//  <i>目前只允许最多4传感器通道，最少设置1个传感器通道。
//
//	<o2.0..1>  打印泽大微信二维码.
//  <0=> [不打印]
//  <1=> [打印]
// 
//  <o3.0..18>  自动更新打印时间段的时间设置.
//  <0=>  	 [00:00]时间更新
//  <3600=>  [01:00]时间更新
//  <7200=>  [02:00]时间更新
//  <10800=> [03:00]时间更新
//  <14400=> [04:00]时间更新
//  <18000=> [05:00]时间更新
//  <21600=> [06:00]时间更新
//  <25200=> [07:00]时间更新
//  <28800=> [08:00]时间更新
//  <32400=> [09:00]时间更新
//  <36000=> [10:00]时间更新
//  <39600=> [11:00]时间更新
//  <43200=> [12:00]时间更新
//  <46800=> [13:00]时间更新
//  <50400=> [14:00]时间更新
//  <54000=> [15:00]时间更新
//  <57600=> [16:00]时间更新
//  <61200=> [17:00]时间更新
//  <64800=> [18:00]时间更新
//  <68400=> [19:00]时间更新
//  <72000=> [20:00]时间更新
//  <75600=> [21:00]时间更新
//  <79200=> [22:00]时间更新
//  <82800=> [23:00]时间更新
// 
//  </e>
#define Print_Function_Enable			(0x01)
#define Print_Sensor_CH_Num				(0x02)
#define Print_ZJUEE_LOGO				(0x00)
#define Print_Time_Updata				(14400)


//===========================================================================
//
//  <e0> [报警]功能配置. 
//  <i>  系统[报警]相关参数配置.
//
//  <o1.0..6>取消报警延时时间设置		<1-64:1>
//  <i>取消报警延时是以(秒)为单位计算。(现在只允许最大64秒的延时)
//
//  <o2.0..4>报警状态检测周期设置		<1-15:1>
//  <i>检测周期是以(秒)为单位计算。(现在只允许最大15秒)
//  </e>
#define Alarm_Config_Enable			(0x01)
#define Alarm_Reset_Delay			(5)
#define Alarm_State_Check_Period	(1)


//===========================================================================
//
//  <e0> [固件升级]功能配置.
//  <i>  当前版本还不能很好的支持固件升级功能.
// 
//  </e>
#define Firmware_Urerade_Function_Enable	(0x01)

//===========================================================================
//
//  <e0> [系统时钟]功能配置.
//  <i>  设置[系统时钟]相关的参数.
// 
//  <o1.0..9>系统时间超前现实时间设置
//  <60 => 超前[1分钟]
//  <120=> 超前[2分钟]
//  <180=> 超前[3分钟]
//  <240=> 超前[4分钟]
//  <300=> 超前[5分钟]
//  <i>目前只允许最多5分钟超前时间，最少设置1分钟。

//  <o2.0..18> 自动更新系统时间设置.
//  <0=>  	 [00:00]时间更新
//  <3600=>  [01:00]时间更新
//  <7200=>  [02:00]时间更新
//  <10800=> [03:00]时间更新
//  <14400=> [04:00]时间更新
//  <18000=> [05:00]时间更新
//  <21600=> [06:00]时间更新
//  <25200=> [07:00]时间更新
//  <28800=> [08:00]时间更新
//  <32400=> [09:00]时间更新
//  <36000=> [10:00]时间更新
//  <39600=> [11:00]时间更新
//  <43200=> [12:00]时间更新
//  <46800=> [13:00]时间更新
//  <50400=> [14:00]时间更新
//  <54000=> [15:00]时间更新
//  <57600=> [16:00]时间更新
//  <61200=> [17:00]时间更新
//  <64800=> [18:00]时间更新
//  <68400=> [19:00]时间更新
//  <72000=> [20:00]时间更新
//  <75600=> [21:00]时间更新
//  <79200=> [22:00]时间更新
//  <82800=> [23:00]时间更新
//  <i>以小时单位选择更新时间(每天更新一次)。

//  </e>
#define System_Clock_Enable					(0x01)
#define System_Time_Lead_Num				(120)
#define System_Clock_Time_Updata			(3600)





//	<<< end of configuration section >>>




/********************************************************** 配置文件保护逻辑 *****************************************************/

/* ADC配置保护逻辑. */
#if (ADC1_Function_Config_Enable == 0x01)


#endif


/* 传感器配置保护逻辑. */
#if (Sensor_Function_Config_Enable == 0x01)

/* 传感器类型 */
#define	Sensor_Null									(0x00)	//未定义 	传感器类型
#define	Sensor_Tmp									(0x01)	//温度   	传感器类型
#define	Sensor_Hum  								(0x02)	//湿度   	传感器类型
#define	Sensor_RF_Card_Single_Tmp		(0x03)	//单温卡片	传感器类型
#define	Sensor_RF_Card_Humiture_Tmp	(0x04)	//温湿卡片 温度 传感器类型
#define	Sensor_RF_Card_Humiture_Hum	(0x05)	//温湿卡片 湿度 传感器类型
#define	Sensor_GPS_POS_Lon					(0x06)	//GPS定位 经度类型
#define	Sensor_GPS_POS_Lat					(0x07)	//GPS定位 纬度类型
#define	Sensor_GPS_POS_Spd					(0x08)	//GPS定位 速度类型
#define	Sensor_PT1000								(0x09)	//PT1000温度传感器类型
#define	Sensor_GW_NJSY_Tmp					(0x0A)	//南京盛亿网关温度探头类型
#define	Sensor_GW_NJSY_Hum					(0x0B)	//南京盛亿网关湿度探头类型
#define	Sensor_GW_HZZH_Tmp					(0x0C)	//杭州创辉温度探头类型
#define	Sensor_GW_HZZH_Hum					(0x0D)	//杭州创辉湿度探头类型
#define	Sensor_CarbonDioxide				(0x0E)	//二氧化碳  传感器类型
#define	Sensor_DoorContact					(0x0F)	//门磁开关  传感器类型


/* 传感器报警类型 */
#define	Sensor_Alarm_Null			(0x00)	//无报警
#define	Sensor_Alarm_Up				(0x01)	//上限报警
#define	Sensor_Alarm_Low  			(0x02)	//下限报警



#endif

/************************************************************************************************/


/************************************************************************************************/





/* 湿度传感器配置保护逻辑 */
#if (Hum_Sensor_Function_Config_Enable == 0x01)

	/* 温度补偿保护逻辑 */
	#if (Hum_Sensor_Tmp_Comp_Enable == 0x01)
		/* 传感器功能 */
		#if (Sensor_Function_Config_Enable != 0x01) 
			#error "没有使能传感器功能."
		#endif
		/* 温度传感器通道数量 */
		#if ((Sensor_Tmp_Num + Sensor_RF_Single_Tmp_Num + Sensor_RF_Humiture_Tmp_Num) > 0)
			#error "配置的传感器中没有温度类型."
		#endif		 
		/* 补偿传感器通道类型 */
		#if (Hum_Sensor_Tmp_Comp_CH == 0x00)
			#error "配置的补偿为0，为无效通道."
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x01)
			#if ((Sensor_CH1_Config_Type != Sensor_Tmp) && (Sensor_CH1_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH1_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道1不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x02)	
			#if ((Sensor_CH2_Config_Type != Sensor_Tmp) && (Sensor_CH2_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH2_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道2不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x03)	
			#if ((Sensor_CH3_Config_Type != Sensor_Tmp) && (Sensor_CH3_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH3_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道3不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x04)	
			#if ((Sensor_CH4_Config_Type != Sensor_Tmp) && (Sensor_CH4_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH4_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道4不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x05)	
			#if ((Sensor_CH5_Config_Type != Sensor_Tmp) && (Sensor_CH5_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH5_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道5不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x06)	
			#if ((Sensor_CH6_Config_Type != Sensor_Tmp) && (Sensor_CH6_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH6_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道6不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x07)	
			#if ((Sensor_CH7_Config_Type != Sensor_Tmp) && (Sensor_CH7_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH7_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道7不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x08)	
			#if ((Sensor_CH8_Config_Type != Sensor_Tmp) && (Sensor_CH8_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH8_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道8不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x09)	
			#if ((Sensor_CH9_Config_Type != Sensor_Tmp) && (Sensor_CH9_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH9_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道9不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x0A)	
			#if ((Sensor_CH10_Config_Type != Sensor_Tmp) && (Sensor_CH10_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH10_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道10不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x0B)	
			#if ((Sensor_CH11_Config_Type != Sensor_Tmp) && (Sensor_CH11_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH11_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道11不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x0C)	
			#if ((Sensor_CH12_Config_Type != Sensor_Tmp) && (Sensor_CH12_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH12_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道12不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x0D)	
			#if ((Sensor_CH13_Config_Type != Sensor_Tmp) && (Sensor_CH13_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH13_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道13不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x0E)	
			#if ((Sensor_CH14_Config_Type != Sensor_Tmp) && (Sensor_CH14_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH14_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道14不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x0F)	
			#if ((Sensor_CH15_Config_Type != Sensor_Tmp) && (Sensor_CH15_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH15_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道15不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x10)	
			#if ((Sensor_CH16_Config_Type != Sensor_Tmp) && (Sensor_CH16_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH16_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道16不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x11)	
			#if ((Sensor_CH17_Config_Type != Sensor_Tmp) && (Sensor_CH17_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH17_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道17不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x12)	
			#if ((Sensor_CH18_Config_Type != Sensor_Tmp) && (Sensor_CH18_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH18_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道18不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x13)	
			#if ((Sensor_CH19_Config_Type != Sensor_Tmp) && (Sensor_CH19_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH19_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道19不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x14)		
			#if ((Sensor_CH20_Config_Type != Sensor_Tmp) && (Sensor_CH20_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH20_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道20不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x15)		
			#if ((Sensor_CH21_Config_Type != Sensor_Tmp) && (Sensor_CH21_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH21_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道21不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x16)	
			#if ((Sensor_CH22_Config_Type != Sensor_Tmp) && (Sensor_CH22_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH22_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道22不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x17)		
			#if ((Sensor_CH23_Config_Type != Sensor_Tmp) && (Sensor_CH23_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH23_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道23不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x18)	
			#if ((Sensor_CH24_Config_Type != Sensor_Tmp) && (Sensor_CH24_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH24_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道24不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x19)	
			#if ((Sensor_CH25_Config_Type != Sensor_Tmp) && (Sensor_CH25_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH25_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道25不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x1A)	
			#if ((Sensor_CH26_Config_Type != Sensor_Tmp) && (Sensor_CH26_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH26_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道26不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x1B)	
			#if ((Sensor_CH27_Config_Type != Sensor_Tmp) && (Sensor_CH27_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH27_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道27不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x1C)	
			#if ((Sensor_CH28_Config_Type != Sensor_Tmp) && (Sensor_CH28_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH28_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道28不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x1D)	
			#if ((Sensor_CH29_Config_Type != Sensor_Tmp) && (Sensor_CH29_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH29_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道29不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x1E)	
			#if ((Sensor_CH30_Config_Type != Sensor_Tmp) && (Sensor_CH30_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH30_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道30不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x1F)	
			#if ((Sensor_CH31_Config_Type != Sensor_Tmp) && (Sensor_CH31_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH31_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道31不是温度类型传感器."
			#endif	
		#elif (Hum_Sensor_Tmp_Comp_CH == 0x20)	
			#if ((Sensor_CH32_Config_Type != Sensor_Tmp) && (Sensor_CH32_Config_Type != Sensor_RF_Card_Single_Tmp) && (Sensor_CH32_Config_Type != Sensor_RF_Card_Humiture_Tmp))
				#error "通道32不是温度类型传感器."
			#endif
		#else
			#error "配置的通道编号不再可选择的范围内（0-32）."
		#endif
		
	
	#endif
#endif



#endif /* __System_Config_h */



















