/************************************************************************************************/
/** @file              : Mcu_USART2.h															*/
/** @author            : HZ Zeda Team															*/
/** @version           : V1.0.0.0																*/
/** @date              : 2016年11月14日															*/
/** @brief             : c file																	*/
/** @description       : 杭州泽大仪器--32位变送器--STM32F103-USART2逻辑层文件						*/
/************************************************************************************************/
/** @attention		   :																		*/
/**																								*/
/** COPYRIGHT 2015 STMicroelectronics															*/
/**																								*/
/************************************************************************************************/
/**版本     作者            日期            说明													*/
/**V0      ZRDang      2016年12月14日     初始版本												*/
/************************************************************************************************/
/************************************************************************************************/
#ifndef __Mcu_USART2_H
#define __Mcu_USART2_H


#include "stm32f10x.h"



/********************************* 端口定义 *********************************/
/* 通信GPIO */
#define USART2_TX_PORT		(GPIOA)
#define USART2_TX_CLK		(RCC_APB2Periph_GPIOA)
#define USART2_TX_PIN		(GPIO_Pin_2)

#define USART2_RX_PORT		(GPIOA)
#define USART2_RX_CLK		(RCC_APB2Periph_GPIOA)
#define USART2_RX_PIN		(GPIO_Pin_3)





/************************************************************************************************/


/****************************************************  函数声明  *********************************************************/
void USART2_Init(uint32_t baudrate,void (*funtp)(uint8_t));
void Mcu_USART2_Close(void);
void Mcu_USART2_Open(void);
#endif
/******************* (C) HZ Zeda Team *******************/

/*******************   (END OF FILE   *******************/
